InformationRegisters/упПравилаВыполненияРейсаВМобильномКлиенте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаВыполненияРейсаВМобильномКлиенте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеноИзменятьПорядокТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОтменятьНовыеТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоОднаТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияПодтвержденияНовыхТочек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОтправкиКоординат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияМестоположения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыОпределенияМестоположения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНавигатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыНавигаторов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереводитьРейсВСтатусВыполняетсяПослеПрибытияВПервуюТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВыводаИнформацииОПолучателе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыВыводаИнформацииОПолучателе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяРозничнаяПродажаВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаНастройкаКассовогоОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрыватьКассовуюСменуПослеВыполненияРейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКассовойТехники</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыВыбораВидовКассовойТехники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКассыККМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАдресаСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОтложенноеВыполнениеЧастиРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот</Name>
					<Comment>Вид доступа для действия "Отложенное выполнение части работ"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДоступаДействийМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаТиповСобытийМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТиповСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовОтложенноеВыполнениеЧастиРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатураДляАвансов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДСДляАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПравилаПрохожденияТочекВМобильномКлиенте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаПрохожденияТочекВМобильномКлиенте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимоеОтклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтчитыватьсяОРаботах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПрисоединенияВнешнихФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыПрисоединенияВнешнихФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппироватьЗадачиПередачиЦенностей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтменятьТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноГрупповоеВыполнениеРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппироватьЗадачиСГрузомВТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособГруппировкиРабот</Name>
					<Comment>Способ группировки работ при осуществлении мультимодальных перевозок</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыГруппировкиРаботНаМобильномКлиенте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрыватьКассовуюСменуПослеУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтменятьРаботыВТочкеВозвратаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Comment>Вид доступа для действия "Досрочное убытие из точки маршрута"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДоступаДействийМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовНазначениеТочкиМаршрутаСледующей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаТиповСобытийМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТиповСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьСтатусГотовностиТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантФормВыводитьСтатусГотовностиТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыФормТочкиМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьИнформациюОСкладскихВоротах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантФормВыводитьИнформациюОСкладскихВоротах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыФормТочкиМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПравилаВыполненияЗадачВМобильномКлиенте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаВыполненияЗадачВМобильномКлиенте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяСканированиеШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяФотография</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПрисоединенияВнешнихФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыПрисоединенияВнешнихФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаУстановкаНовогоШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособФормированияНомераРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыФормированияНомераРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьКомментарийПоЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьНомерИсходногоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособФормированияНомераДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыФормированияНомераРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяФотографияПриОтменеЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСостава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтчитыватьсяОРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеобходимостьФотографииОпределяетсяНаУровнеПроблемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноПробитиеКассовогоЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробиватьКаждыйЧекОтдельнойКассовойСменой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВариантыВыбораВидовКассовойТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыВыбораВидовКассовойТехники</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АТОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IBOX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыДоступаДействийМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыДоступаДействийМобильныйКлиент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗапросу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/упПравилаРаботыМобильногоКлиента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаборРегистраЗадач = РеквизитФормыВЗначение("ПравилаВыполненияЗадач");
	НаборРегистраЗадач.Прочитать();
	ЗначениеВРеквизитФормы(НаборРегистраЗадач,"ПравилаВыполненияЗадач");
	
	НаборРегистраТочек = РеквизитФормыВЗначение("ПравилаПрохожденияТочек");
	НаборРегистраТочек.Прочитать();
	ЗначениеВРеквизитФормы(НаборРегистраТочек,"ПравилаПрохожденияТочек");
		
	Для каждого текСтрока Из ПравилаПрохожденияТочек Цикл
		Если текСтрока.ДопустимоеОтклонение > 0 Тогда
			текСтрока.КонтролироватьКоординатыВодителяПриПрохожденииТочки = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ПолучитьФункциональнуюОпцию("упВедетсяУчетТары") Тогда
		Элементы.ПравилаПрохожденияТочекСпособГруппировкиРабот.Видимость = Ложь;
	КонецЕсли; 
	
	НаборРегистраРейс = РеквизитФормыВЗначение("ПравилаВыполненияРейса");
	НаборРегистраРейс.Прочитать();
	ЗначениеВРеквизитФормы(НаборРегистраРейс,"ПравилаВыполненияРейса");
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#Область ПравилаВыполненияРейсаВМобильномКлиенте

&НаКлиенте
Процедура ПравилаВыполненияРейсаРазрешеноИзменятьПорядокТочекПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаРазрешеноОтменятьНовыеТочкиПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаТолькоОднаТочкаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаПереводитьРейсВСтатусВыполняетсяПослеПрибытияВПервуюТочкуПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВремяОжиданияПодтвержденияНовыхТочекПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаПериодичностьОтправкиКоординатПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаСпособОпределенияМестоположенияПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаСпособВыводаИнформацииОПолучателеПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВидНавигатораПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВедетсяРозничнаяПродажаВРейсеПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры


&НаКлиенте
Процедура ПравилаВыполненияРейсаИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧекаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаРазрешенаНастройкаКассовогоОборудованияПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаЗакрыватьКассовуюСменуПослеВыполненияРейсаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВидКассовойТехникиПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаКассаККМПоУмолчаниюПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаНоменклатураДляАвансовПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаСтавкаНДСДляАвансовПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаЗапрещеноИзменениеПорядкаПогрузкиНаСкладахПриИзменении(Элемент)
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВидАдресаСкладаПриИзменении(Элемент)
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаГруппаТиповСобытийМониторингаПриИзменении(Элемент)
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаРазрешеноОтложенноеВыполнениеЧастиРаботПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаВидДоступаДействиеОтложенноеВыполнениеЧастиРаботПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияРейса();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаНастройкаОтветовОтложенноеВыполнениеЧастиРаботПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Данные)
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Менеджер = РегистрыСведений.упПравилаВыполненияРейсаВМобильномКлиенте.СоздатьМенеджерЗаписи();
	Менеджер.Перевозчик = Данные.Перевозчик;
	Менеджер.Водитель   = Данные.Водитель;
	Менеджер.Прочитать();
	ЗаполнитьЗначенияСвойств(Менеджер,Данные);
	Менеджер.Записать(Истина);
	
	Модифицированность = Ложь;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПравилаВыполненияРейсаПередУдалением(Элемент, Отказ)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте(Отказ);
	УдалитьНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаборупПравилаВыполненияРейсаВМобильномКлиенте(Данные)
	
	 Если Данные = Неопределено Тогда
	 	Возврат;
	 КонецЕсли;
	 	
	 Менеджер = РегистрыСведений.упПравилаВыполненияРейсаВМобильномКлиенте.СоздатьМенеджерЗаписи();
	 Менеджер.Перевозчик = Данные.Перевозчик;
	 Менеджер.Водитель   = Данные.Водитель;
	 Менеджер.Прочитать();
	 Менеджер.Удалить();
	 
КонецПроцедуры	

&НаКлиенте
Функция ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте(Отказ = Ложь)
	
	Модифицированность = Истина;
	
	ПроверитьЗаполнениеПравилаВыполненияРейсаВМобильномКлиенте(Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Водитель"                                                 , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.Водитель);
	Структура.Вставить("Перевозчик"                                               , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.Перевозчик);
	Структура.Вставить("РазрешеноИзменятьПорядокТочек"                            , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.РазрешеноИзменятьПорядокТочек);
	Структура.Вставить("РазрешеноОтменятьНовыеТочки"                              , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.РазрешеноОтменятьНовыеТочки);
	Структура.Вставить("ТолькоОднаТочка"                                          , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ТолькоОднаТочка);
	Структура.Вставить("ВремяОжиданияПодтвержденияНовыхТочек"                     , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВремяОжиданияПодтвержденияНовыхТочек);
	Структура.Вставить("ПериодичностьОтправкиКоординат"                           , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ПериодичностьОтправкиКоординат);
	Структура.Вставить("СпособОпределенияМестоположения"                          , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.СпособОпределенияМестоположения);
	Структура.Вставить("ВидНавигатора"                                            , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВидНавигатора);
	Структура.Вставить("ПереводитьРейсВСтатусВыполняетсяПослеПрибытияВПервуюТочку", Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ПереводитьРейсВСтатусВыполняетсяПослеПрибытияВПервуюТочку);
	Структура.Вставить("СпособВыводаИнформацииОПолучателе"                        , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.СпособВыводаИнформацииОПолучателе);
	Структура.Вставить("ВедетсяРозничнаяПродажаВРейсе"                            , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВедетсяРозничнаяПродажаВРейсе);
	Структура.Вставить("РазрешенаНастройкаКассовогоОборудования"                  , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.РазрешенаНастройкаКассовогоОборудования);
	Структура.Вставить("ЗакрыватьКассовуюСменуПослеВыполненияРейса"               , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ЗакрыватьКассовуюСменуПослеВыполненияРейса);
	Структура.Вставить("ВидКассовойТехники"                                       , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВидКассовойТехники);
	Структура.Вставить("КассаККМПоУмолчанию"                                      , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.КассаККМПоУмолчанию);
	Структура.Вставить("ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах"               , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах);
	Структура.Вставить("ВидАдресаСклада"                                          , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВидАдресаСклада);
	Структура.Вставить("РазрешеноОтложенноеВыполнениеЧастиРабот"                  , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.РазрешеноОтложенноеВыполнениеЧастиРабот);
	Структура.Вставить("ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот"         , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот);
	Структура.Вставить("ГруппаТиповСобытийМониторинга"                            , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ГруппаТиповСобытийМониторинга);
	Структура.Вставить("НастройкаОтветовОтложенноеВыполнениеЧастиРабот"           , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.НастройкаОтветовОтложенноеВыполнениеЧастиРабот);
	Структура.Вставить("НоменклатураДляАвансов"                                   , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.НоменклатураДляАвансов);
	Структура.Вставить("СтавкаНДСДляАвансов"                                      , Элементы.ПравилаВыполненияРейса.ТекущиеДанные.СтавкаНДСДляАвансов);
	Структура.Вставить("ИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧека", Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧека);
	
	Возврат Структура;
	
КонецФункции	

&НаКлиенте
Процедура ПроверитьЗаполнениеПравилаВыполненияРейсаВМобильномКлиенте(Отказ)
	
	Если Истина
		И Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах
		И Не ЗначениеЗаполнено(Элементы.ПравилаВыполненияРейса.ТекущиеДанные.ВидАдресаСклада)
	Тогда
		ТекстОшибки = Нстр("ru = 'При включенной опции ""Запрещено изменение порядка погрузки на складах"", поле ""Вид адреса склада"" должно быть заполнено.(Изменения в правилах не сохранены)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		Структура = ЗаполнитьСтруктуруПравилаВыполненияРейсаВМобильномКлиенте();
		ЗаписатьИзмененныйНаборупПравилаВыполненияРейсаВМобильномКлиенте(Структура);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	отбор = Новый Структура;
	отбор.Вставить("Водитель",   Элементы.ПравилаВыполненияРейса.ТекущиеДанные.Водитель);
	отбор.Вставить("Перевозчик", Элементы.ПравилаВыполненияРейса.ТекущиеДанные.Перевозчик);
	НайденоСтрок = ПравилаВыполненияРейса.НайтиСтроки(Отбор);
	
	Если НайденоСтрок.Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Запись с такими измерениями уже существует в регистре");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияРейсаПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьПравилВыполненияРейса();
	
КонецПроцедуры

#КонецОбласти

#Область ПравилаПрохожденияТочекВМобильномКлиенте

&НаКлиенте
Процедура ПравилаПрохожденияТочекПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Данные)
	
	 Менеджер = РегистрыСведений.упПравилаПрохожденияТочекВМобильномКлиенте.СоздатьМенеджерЗаписи();
	 Менеджер.Перевозчик  = Данные.Перевозчик;
	 Менеджер.Водитель    = Данные.Водитель;
	 Менеджер.Адрес       = Данные.Адрес;
	 Менеджер.ВидАдреса   = Данные.ВидАдреса;
	 Менеджер.Прочитать();
	 ЗаполнитьЗначенияСвойств(Менеджер,Данные);
	 Менеджер.Записать(Истина);
	 
КонецПроцедуры	
 
 &НаСервере
Процедура УдалитьНаборупПравилаПрохожденияТочекВМобильномКлиенте(Данные)
	
	 Менеджер = РегистрыСведений.упПравилаПрохожденияТочекВМобильномКлиенте.СоздатьМенеджерЗаписи();
	 Менеджер.Перевозчик  = Данные.Перевозчик;
	 Менеджер.Водитель    = Данные.Водитель;
	 Менеджер.Адрес       = Данные.Адрес;
	 Менеджер.ВидАдреса   = Данные.ВидАдреса;
	 Менеджер.Прочитать();
	 Менеджер.Удалить();
	 
КонецПроцедуры	

&НаКлиенте
Функция ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте()
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес"                                                  , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Адрес);
	Структура.Вставить("Перевозчик"                                             , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Перевозчик);
	Структура.Вставить("Водитель"                                               , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Водитель);
	Структура.Вставить("ВидАдреса"                                              , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВидАдреса);
	Структура.Вставить("ДопустимоеОтклонение"                                   , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ДопустимоеОтклонение);
	Структура.Вставить("ЗапрещеноОтчитыватьсяОРаботах"                          , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ЗапрещеноОтчитыватьсяОРаботах);
	Структура.Вставить("СпособПрисоединенияВнешнихФайлов"                       , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.СпособПрисоединенияВнешнихФайлов);
	Структура.Вставить("ГруппироватьЗадачиПередачиЦенностей"                    , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ГруппироватьЗадачиПередачиЦенностей);
	Структура.Вставить("ЗапрещеноОтменятьТочкиМаршрута"                         , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ЗапрещеноОтменятьТочкиМаршрута);
	Структура.Вставить("РазрешеноГрупповоеВыполнениеРабот"                      , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.РазрешеноГрупповоеВыполнениеРабот);
	Структура.Вставить("ГруппироватьЗадачиСГрузомВТаре"                         , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ГруппироватьЗадачиСГрузомВТаре);
	Структура.Вставить("СпособГруппировкиРабот"                                 , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.СпособГруппировкиРабот);
	Структура.Вставить("ЗакрыватьКассовуюСменуПослеУбытияИзТочки"               , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ЗакрыватьКассовуюСменуПослеУбытияИзТочки);
	Структура.Вставить("ЗапрещеноОтменятьРаботыВТочкеВозвратаНаСклад"           , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ЗапрещеноОтменятьРаботыВТочкеВозвратаНаСклад);
	Структура.Вставить("РазрешеноДосрочноеУбытиеИзТочкиМаршрута"                , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.РазрешеноДосрочноеУбытиеИзТочкиМаршрута);
	Структура.Вставить("ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута"       , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута);
	Структура.Вставить("ЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующей", Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующей);
	Структура.Вставить("ГруппаТиповСобытийМониторинга"                          , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ГруппаТиповСобытийМониторинга);
	Структура.Вставить("ВыводитьСтатусГотовностиТочки"                          , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВыводитьСтатусГотовностиТочки);
	Структура.Вставить("ВариантФормВыводитьСтатусГотовностиТочки"               , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВариантФормВыводитьСтатусГотовностиТочки);
	Структура.Вставить("ВыводитьИнформациюОСкладскихВоротах"                    , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВыводитьИнформациюОСкладскихВоротах);
	Структура.Вставить("ВариантФормВыводитьИнформациюОСкладскихВоротах"         , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВариантФормВыводитьИнформациюОСкладскихВоротах);
	Структура.Вставить("НастройкаОтветовНазначениеТочкиМаршрутаСледующей"       , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.НастройкаОтветовНазначениеТочкиМаршрутаСледующей);
	Структура.Вставить("НастройкаОтветовДосрочноеУбытиеИзТочкиМаршрута"         , Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.НастройкаОтветовДосрочноеУбытиеИзТочкиМаршрута);
	
	Возврат Структура;
	
КонецФункции	

&НаКлиенте
Процедура ПравилаПрохожденияТочекДопустимоеОтклонениеПриИзменении(Элемент)

	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекЗапрещеноОтчитыватьсяОРаботахПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекРазрешеноГрупповоеВыполнениеРаботПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекЗапрещеноОтменятьРаботыВТочкеВозвратаНаСкладПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекЗапрещеноОтменятьТочкиМаршрутаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекСпособПрисоединенияВнешнихФайловПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекГруппироватьЗадачиСГрузомВТареПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекСпособГруппировкиРаботПриИзменении(Элемент) 
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекРазрешеноДосрочноеУбытиеИзТочкиМаршрутаПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекНастройкаОтветовНазначениеТочкиМаршрутаСледующейПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрутаПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекНастройкаОтветовДосрочноеУбытиеИзТочкиМаршрутаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующейПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекГруппаТиповСобытийМониторингаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекВыводитьСтатусГотовностиТочкиПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекВариантФормВыводитьСтатусГотовностиТочкиПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекВыводитьИнформациюОСкладскихВоротахПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекВариантФормВыводитьИнформациюОСкладскихВоротахПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекКонтролироватьКоординатыВодителяПриПрохожденииТочкиПриИзменении(Элемент)
	
	УстановитьДоступностьПравилПрохожденияТочек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекГруппироватьЗадачиПередачиЦенностейПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекЗакрыватьКассовуюСменуПослеУбытияИзТочкиПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
		ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекПередУдалением(Элемент, Отказ)
	
	Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
	УдалитьНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаПрохожденияТочекПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	отбор = Новый Структура;
	отбор.Вставить("Водитель",							  Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Водитель);
	отбор.Вставить("Перевозчик",						  Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Перевозчик);
	отбор.Вставить("ВидАдреса",							  Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.ВидАдреса);
	отбор.Вставить("Адрес",						          Элементы.ПравилаПрохожденияТочек.ТекущиеДанные.Адрес);
	НайденоСтрок = ПравилаПрохожденияТочек.НайтиСтроки(Отбор);
	
	Если НайденоСтрок.Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Запись с такими измерениями уже существует в регистре");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ПравилаВыполненияЗадачВМобильномКлиенте

&НаКлиенте
Процедура ПравилаВыполненияЗадачПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Данные)
	
	 Менеджер = РегистрыСведений.упПравилаВыполненияЗадачВМобильномКлиенте.СоздатьМенеджерЗаписи();
	 Менеджер.Перевозчик  = Данные.Перевозчик;
	 Менеджер.Водитель    = Данные.Водитель;
	 Менеджер.ТипОперации = Данные.ТипОперации;
	 Менеджер.ВидАдреса   = Данные.ВидАдреса;
	 Менеджер.Прочитать();
	 ЗаполнитьЗначенияСвойств(Менеджер,Данные);
	 Менеджер.Записать(Истина);
	 
КонецПроцедуры	

&НаКлиенте
Функция ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте()
	
	Структура = Новый Структура;
	Структура.Вставить("ТипОперации"                                                , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТипОперации);
	Структура.Вставить("Перевозчик"                                                 , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.Перевозчик);
	Структура.Вставить("Водитель"                                                   , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.Водитель);
	Структура.Вставить("ВидАдреса"                                                  , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ВидАдреса);
	Структура.Вставить("ТребуетсяСканированиеШК"                                    , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТребуетсяСканированиеШК);
	Структура.Вставить("ТребуетсяФотография"                                        , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТребуетсяФотография);
	Структура.Вставить("ТребуетсяФотографияПриОтменеЗадачи"                         , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТребуетсяФотографияПриОтменеЗадачи);
	Структура.Вставить("НеобходимостьФотографииОпределяетсяНаУровнеПроблемы"        , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.НеобходимостьФотографииОпределяетсяНаУровнеПроблемы);
	Структура.Вставить("СпособПрисоединенияВнешнихФайлов"                           , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.СпособПрисоединенияВнешнихФайлов);
	Структура.Вставить("РазрешенаУстановкаНовогоШК"                                 , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.РазрешенаУстановкаНовогоШК);
	Структура.Вставить("СпособФормированияНомераРаботы"                             , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.СпособФормированияНомераРаботы);
	Структура.Вставить("ВыводитьКомментарийПоЗаявке"                                , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ВыводитьКомментарийПоЗаявке);
	Структура.Вставить("ВыводитьНомерИсходногоДокумента"                            , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ВыводитьНомерИсходногоДокумента);
	Структура.Вставить("СпособФормированияНомераДокумента"                          , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.СпособФормированияНомераДокумента);
	Структура.Вставить("РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава"     , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава);
	Структура.Вставить("ТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСостава" , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСостава);
	Структура.Вставить("ЗапрещеноОтчитыватьсяОРаботе"                               , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ЗапрещеноОтчитыватьсяОРаботе);
	Структура.Вставить("РазрешеноПробитиеКассовогоЧека"                             , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.РазрешеноПробитиеКассовогоЧека);
	Структура.Вставить("ПробиватьКаждыйЧекОтдельнойКассовойСменой"                  , Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ПробиватьКаждыйЧекОтдельнойКассовойСменой);
	
	Возврат Структура;
	
КонецФункции	

&НаКлиенте
Процедура ПравилаВыполненияЗадачТребуетсяСканированиеШКПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачРазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСоставаПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСоставаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачРазрешенаУстановкаНовогоШКПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачТребуетсяФотографияПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачЗапрещеноОтчитыватьсяОРаботеПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачТребуетсяФотографияПриОтменеЗадачиПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачНеобходимостьФотографииОпределяетсяНаУровнеПроблемыПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачВыводитьКомментарийПоЗаявкеПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачСпособПрисоединенияВнешнихФайловПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачСпособФормированияНомераРаботыПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачВыводитьНомерИсходногоДокументаПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачСпособФормированияНомераДокументаПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачРазрешеноПробитиеКассовогоЧекаПриИзменении(Элемент)
	
	УстановитьДоступностьПравилВыполненияЗадач();
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачПробиватьКаждыйЧекОтдельнойКассовойСменойПриИзменении(Элемент)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
		ЗаписатьИзмененныйНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНаборупПравилаВыполненияЗадачВМобильномКлиенте(Данные)
	
	 Менеджер = РегистрыСведений.упПравилаВыполненияЗадачВМобильномКлиенте.СоздатьМенеджерЗаписи();
	 Менеджер.Перевозчик  = Данные.Перевозчик;
	 Менеджер.Водитель    = Данные.Водитель;
	 Менеджер.ТипОперации = Данные.ТипОперации;
	 Менеджер.ВидАдреса   = Данные.ВидАдреса;
	 Менеджер.Прочитать();
	 Менеджер.Удалить();
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПравилаВыполненияЗадачПередУдалением(Элемент, Отказ)
	
	Структура = ЗаполнитьСтруктуруПравилаВыполненияЗадачВМобильномКлиенте();
	УдалитьНаборупПравилаВыполненияЗадачВМобильномКлиенте(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыполненияЗадачПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	отбор = Новый Структура;
	отбор.Вставить("Водитель",							  Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.Водитель);
	отбор.Вставить("Перевозчик",						  Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.Перевозчик);
	отбор.Вставить("ТипОперации",						  Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ТипОперации);
	отбор.Вставить("ВидАдреса",						      Элементы.ПравилаВыполненияЗадач.ТекущиеДанные.ВидАдреса);
	НайденоСтрок = ПравилаВыполненияЗадач.НайтиСтроки(Отбор);
	
	Если НайденоСтрок.Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Запись с такими измерениями уже существует в регистре");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьПравилВыполненияРейса()

	текСтрока = Элементы.ПравилаВыполненияРейса.ТекущиеДанные;
	Если Не текСтрока = Неопределено Тогда
		Элементы.ПравилаВыполненияРейсаРазрешенаНастройкаКассовогоОборудования.Доступность          = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаЗакрыватьКассовуюСменуПослеВыполненияРейса.Доступность       = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаВидКассовойТехники.Доступность                               = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаНоменклатураДляАвансов.Доступность                           = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаСтавкаНДСДляАвансов.Доступность                              = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧека.Доступность = текСтрока.ВедетсяРозничнаяПродажаВРейсе;
		Элементы.ПравилаВыполненияРейсаКассаККМПоУмолчанию.Доступность                              = (текСтрока.ВедетсяРозничнаяПродажаВРейсе И Не текСтрока.ВидКассовойТехники = ПредопределенноеЗначение("Перечисление.упВариантыВыбораВидовКассовойТехники.АТОЛ"));
		Элементы.ПравилаВыполненияРейсаВидДоступаДействиеОтложенноеВыполнениеЧастиРабот.Доступность = текСтрока.РазрешеноОтложенноеВыполнениеЧастиРабот;
		Элементы.ПравилаВыполненияРейсаВидАдресаСклада.Доступность                                  = текСтрока.ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах;
		Элементы.ПравилаВыполненияРейсаНастройкаОтветовОтложенноеВыполнениеЧастиРабот.Доступность   = текСтрока.РазрешеноОтложенноеВыполнениеЧастиРабот И (текСтрока.ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот = ПредопределенноеЗначение("Перечисление.упВидыДоступаДействийМобильныйКлиент.ПоЗапросу"));
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПравилПрохожденияТочек()

	текСтрока = Элементы.ПравилаПрохожденияТочек.ТекущиеДанные;
	Если Не текСтрока = Неопределено Тогда
		Элементы.ПравилаПрохожденияТочекДопустимоеОтклонение.Доступность = текСтрока.КонтролироватьКоординатыВодителяПриПрохожденииТочки; 
		Если Не текСтрока.КонтролироватьКоординатыВодителяПриПрохожденииТочки И текСтрока.ДопустимоеОтклонение > 0 Тогда
			текСтрока.ДопустимоеОтклонение = 0;
			Структура = ЗаполнитьСтруктуруПравилаПрохожденияТочекВМобильномКлиенте();
			ЗаписатьИзмененныйНаборупПравилаПрохожденияТочекВМобильномКлиенте(Структура);
		КонецЕсли; 
		
		Если текСтрока.ЗапрещеноОтчитыватьсяОРаботах Тогда
			Элементы.ПравилаПрохожденияТочекРазрешеноГрупповоеВыполнениеРабот.Доступность = Ложь;
		ИначеЕсли текСтрока.РазрешеноГрупповоеВыполнениеРабот Тогда
			Элементы.ПравилаПрохожденияТочекЗапрещеноОтчитыватьсяОРаботах.Доступность = Ложь;
		Иначе
			Элементы.ПравилаПрохожденияТочекРазрешеноГрупповоеВыполнениеРабот.Доступность = Истина;
			Элементы.ПравилаПрохожденияТочекЗапрещеноОтчитыватьсяОРаботах.Доступность     = Истина;
		КонецЕсли; 
		
		Элементы.ПравилаПрохожденияТочекСпособГруппировкиРабот.Доступность = текСтрока.ГруппироватьЗадачиСГрузомВТаре;
		Элементы.ПравилаПрохожденияТочекВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута.Доступность = текСтрока.РазрешеноДосрочноеУбытиеИзТочкиМаршрута;
		
		Элементы.ПравилаПрохожденияТочекВариантФормВыводитьСтатусГотовностиТочки.Доступность = текСтрока.ВыводитьСтатусГотовностиТочки;
		Элементы.ПравилаПрохожденияТочекВариантФормВыводитьИнформациюОСкладскихВоротах.Доступность = текСтрока.ВыводитьИнформациюОСкладскихВоротах;
		Элементы.ПравилаПрохожденияТочекНастройкаОтветовНазначениеТочкиМаршрутаСледующей.Доступность = текСтрока.ЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующей;
		Элементы.ПравилаПрохожденияТочекНастройкаОтветовДосрочноеУбытиеИзТочкиМаршрута.Доступность = текСтрока.РазрешеноДосрочноеУбытиеИзТочкиМаршрута И (текСтрока.ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута = ПредопределенноеЗначение("Перечисление.упВидыДоступаДействийМобильныйКлиент.ПоЗапросу"));
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПравилВыполненияЗадач()

	текСтрока = Элементы.ПравилаВыполненияЗадач.ТекущиеДанные;
	Если Не текСтрока = Неопределено Тогда
		Если текСтрока.ТипОперации = ПредопределенноеЗначение("Перечисление.упТипыОпераций.ДополнительнаяОперация") Тогда 
			Элементы.ПравилаВыполненияЗадачТребуетсяСканированиеШК.Доступность = Ложь;	
		Иначе	
			Элементы.ПравилаВыполненияЗадачТребуетсяСканированиеШК.Доступность = Истина;
		КонецЕсли;	
		
		Элементы.ПравилаВыполненияЗадачРазрешенаУстановкаНовогоШК.Доступность                                 = текСтрока.ТребуетсяСканированиеШК; 
		Элементы.ПравилаВыполненияЗадачСпособФормированияНомераДокумента.Доступность                          = текСтрока.ВыводитьНомерИсходногоДокумента; 
		Элементы.ПравилаВыполненияЗадачТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСостава.Доступность = текСтрока.РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава; 
		Элементы.ПравилаВыполненияЗадачНеобходимостьФотографииОпределяетсяНаУровнеПроблемы.Доступность        = текСтрока.ТребуетсяФотографияПриОтменеЗадачи; 
		Элементы.ПравилаВыполненияЗадачПробиватьКаждыйЧекОтдельнойКассовойСменой.Доступность                  = текСтрока.РазрешеноПробитиеКассовогоЧека; 
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти
